app/controllers/articles_controller.rb

  def index
    @article = Article.all
---
SELECT "articles".* FROM "articles"